app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "bio", "twitter", "facebook", "soundcloud", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]