app/controllers/releases_controller.rb

SELECT "releases".* FROM "releases"
---
  def index
    @releases = Release.all

SELECT  "releases".* FROM "releases" WHERE "releases"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @release = Release.find(params[:id])

INSERT INTO "releases" ("name", "details", "link", "credits", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @release = Release.new(release_params)

    respond_to do |format|
      if @release.save

UPDATE "releases" SET "link" = ?, "updated_at" = ? WHERE "releases"."id" = ?  [["link", "https://soundcloud.com/sokmusic/realtalk-01-soundofkla/s-DOygP"], ["updated_at", "2015-05-27 19:08:35.349608"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @release.update(release_params)

DELETE FROM "releases" WHERE "releases"."id" = ?  [["id", 1]]
---
  def destroy
    @release.destroy

SELECT  "releases".* FROM "releases" WHERE "releases"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_release
      @release = Release.find(params[:id])